using System;
Console.Clear();

/*Console.Write("Введите А: ");
//int A = int.Parse(Console.ReadLine());
//Console.WriteLine(Summ(A));
Console.WriteLine(Summ(int.Parse(Console.ReadLine())));

int Summ(int number)
{
    int sum=0;
    for (int i = 0; i <= number; i++)
    {
        sum +=i;
    }
    return sum;
}
*/
/*Console.Write("Введите число: ");
int num = int.Parse(Console.ReadLine());
Console.WriteLine($"Количество цифр введенного числа : {N(num)}");

int N (int num)
{
    int i = 0;
    while (num>0)
    {
      num/=10;
      i++;
    }
    return i;
} */

// Напишите программу, которая принимает на вход число N и выдает произведение чисел о 1 до N, 4 -> 24

/*Console.Write("Введите А: ");
Console.WriteLine(Summ(int.Parse(Console.ReadLine())));

int Summ(int number)
{
    int sum=1;
    for (int i = 1; i <= number; i++)
    {
        sum *=i;
    }
    return sum;
} */

/* Напишите программу, которая выводит массив из 8 элеметов, заполненный нулями и единицами 
в случайном порядке. [1, 0, 1, 1, 0, 0, 1, 0, 0] */

/* int[] array = new int[8];


  for (int i = 0; i < array.Length; i++)
    {
        array[i] = new Random().Next(0, 2);
    }
    Console.WriteLine(String.Join(" ", array)); */